0xsmirk/mcu_cmsis_svd/Nuvoton/M051_Series.svd
       <register>
          <name>REGWRPROT</name>
          <description>Register Lock Key address</description>
          <addressOffset>0x00000100</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>REGWRPROT</name>
              <description>Register Write-Protected Code (Write Only)
Some write-protected registers have to be disabled the protected function by writing the sequence value &quot;59h&quot;, &quot;16h&quot;, &quot;88h&quot; to this field. After this sequence is completed, the REGPROTDIS bit will be set to 1 and write-protected registers can be normal write.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>REGPROTDIS</name>
              <description>Register Write-Protected Disable index (Read only)
1 = Protection is disabled for writing protected registers
0 = Protection is enabled for writing protected registers. Any write to the protected register is ignored.
The Write-Protected registers list are below table:
Registers	Address	Note	
IPRSTC1	0x5000_0008	None	
BODCR	0x5000_0018	None	
PORCR	0x5000_001C	None	
PWRCON	0x5000_0200	bit[6] is not protected for power wake-up interrupt clear	
APBCLK bit[0]	0x5000_0208	bit[0] is watch dog clock enable	
CLKSEL0	0x5000_0210	HCLK and CPU STCLK clock source select	
CLK_SEL1 bit[1:0]	0x5000_0214	Watch dog clock source select	
ISPCON	0x5000_C000	Flash ISP Control register	
WTCR	0x4000_4000	None	
FATCON	0x5000_C018	None	</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>GP0</name>
      <description>Registers group</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x50004000</baseAddress>
      <!-- the first addressBlock is occupied by registers. The second block is reserved -> no access permission -->
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00000024</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
       <register>
          <name>PMD</name>
          <description>Bit Mode Control</description>
          <addressOffset>0x00000000</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000ffff</resetValue>
          <resetMask>0xffff0000</resetMask>
          <fields>
            <field>
              <name>PMD0</name>
              <description>P0 I/O Pin[0] Mode Control
Determine each I/O type of P0 pins
00 = P0[0] pin is in INPUT mode.
01 = P0[0] pin is in OUTPUT mode.
10 = P0[0] pin is in Open-Drain mode.
11 = P0[0] pin is in Quasi-bidirectional mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>PMD1</name>
              <description>P0 I/O Pin[1] Mode Control
Determine each I/O type of P0 pins
00 = P0[1] pin is in INPUT mode.
01 = P0[1] pin is in OUTPUT mode.
10 = P0[1] pin is in Open-Drain mode.
11 = P0[1] pin is in Quasi-bidirectional mode.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>PMD2</name>
              <description>P0 I/O Pin[2] Mode Control
Determine each I/O type of P0 pins
00 = P0[2] pin is in INPUT mode.
01 = P0[2] pin is in OUTPUT mode.
10 = P0[2] pin is in Open-Drain mode.
11 = P0[2] pin is in Quasi-bidirectional mode.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>PMD3</name>
              <description>P0 I/O Pin[3] Mode Control
Determine each I/O type of P0 pins
00 = P0[3] pin is in INPUT mode.
01 = P0[3] pin is in OUTPUT mode.
10 = P0[3] pin is in Open-Drain mode.
11 = P0[3] pin is in Quasi-bidirectional mode.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>PMD4</name>
              <description>P0 I/O Pin[4] Mode Control
Determine each I/O type of P0 pins
00 = P0[4] pin is in INPUT mode.
01 = P0[4] pin is in OUTPUT mode.
10 = P0[4] pin is in Open-Drain mode.
11 = P0[4] pin is in Quasi-bidirectional mode.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>PMD5</name>
              <description>P0 I/O Pin[5] Mode Control
Determine each I/O type of P0 pins
00 = P0[5] pin is in INPUT mode.
01 = P0[5] pin is in OUTPUT mode.
10 = P0[5] pin is in Open-Drain mode.
11 = P0[5] pin is in Quasi-bidirectional mode.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>PMD6</name>
              <description>P0 I/O Pin[6] Mode Control
Determine each I/O type of P0 pins
00 = P0[6] pin is in INPUT mode.
01 = P0[6] pin is in OUTPUT mode.
10 = P0[6] pin is in Open-Drain mode.
11 = P0[6] pin is in Quasi-bidirectional mode.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>PMD7</name>
              <description>P0 I/O Pin[7] Mode Control
Determine each I/O type of P0 pins
00 = P0[7] pin is in INPUT mode.
01 = P0[7] pin is in OUTPUT mode.
10 = P0[7] pin is in Open-Drain mode.
11 = P0[7] pin is in Quasi-bidirectional mode.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
       <register>
          <name>OFFD</name>
          <description>Bit OFF Digital Enable</description>
          <addressOffset>0x00000004</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>OFFD</name>
              <description>OFFD: P0 Pin OFF digital input path Enable
1 = Disable IO digital input path (digital input tied to low)
0 = Enable IO digital input path</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
       <register>
          <name>DOUT</name>
          <description>Data Output Value</description>
          <addressOffset>0x00000008</addressOffset>
          <access>read-write</access>
          <resetValue>0x000000ff</resetValue>
          <resetMask>0xffffff00</resetMask>
          <fields>
            <field>
              <name>DOUT0</name>
              <description>P0 Pin[0] Output Value
Each of these bits control the status of a P0 pin when the P0 pin is configures as output, open-drain and quasi-mode.
1 = P0 Pin[0] will drive High if the corresponding output mode enabling bit is set.
0 = P0 Pin[0] will drive Low if the corresponding output mode enabling bit is set.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>DOUT1</name>
              <description>P0 Pin[1] Output Value
Each of these bits control the status of a P0 pin when the P0 pin is configures as output, open-drain and quasi-mode.
1 = P0 Pin[1] will drive High if the corresponding output mode enabling bit is set.
0 = P0 Pin[1] will drive Low if the corresponding output mode enabling bit is set.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>DOUT2</name>
              <description>P0 Pin[2] Output Value
Each of these bits control the status of a P0 pin when the P0 pin is configures as output, open-drain and quasi-mode.
1 = P0 Pin[2] will drive High if the corresponding output mode enabling bit is set.
0 = P0 Pin[2] will drive Low if the corresponding output mode enabling bit is set.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>DOUT3</name>
              <description>P0 Pin[3] Output Value
Each of these bits control the status of a P0 pin when the P0 pin is configures as output, open-drain and quasi-mode.
1 = P0 Pin[3] will drive High if the corresponding output mode enabling bit is set.
0 = P0 Pin[3] will drive Low if the corresponding output mode enabling bit is set.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>DOUT4</name>
              <description>P0 Pin[4] Output Value
Each of these bits control the status of a P0 pin when the P0 pin is configures as output, open-drain and quasi-mode.
1 = P0 Pin[4] will drive High if the corresponding output mode enabling bit is set.
0 = P0 Pin[4] will drive Low if the corresponding output mode enabling bit is set.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>DOUT5</name>
              <description>P0 Pin[5] Output Value
Each of these bits control the status of a P0 pin when the P0 pin is configures as output, open-drain and quasi-mode.
1 = P0 Pin[5] will drive High if the corresponding output mode enabling bit is set.
0 = P0 Pin[5] will drive Low if the corresponding output mode enabling bit is set.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>DOUT6</name>
              <description>P0 Pin[6] Output Value
Each of these bits control the status of a P0 pin when the P0 pin is configures as output, open-drain and quasi-mode.
1 = P0 Pin[6] will drive High if the corresponding output mode enabling bit is set.
0 = P0 Pin[6] will drive Low if the corresponding output mode enabling bit is set.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>DOUT7</name>
              <description>P0 Pin[7] Output Value
Each of these bits control the status of a P0 pin when the P0 pin is configures as output, open-drain and quasi-mode.
1 = P0 Pin[7] will drive High if the corresponding output mode enabling bit is set.
0 = P0 Pin[7] will drive Low if the corresponding output mode enabling bit is set.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
