0xsmirk/mcu_cmsis_svd/Nuvoton/M051_Series.svd
       <register>
          <name>UA_MSR</name>
          <description>UART0 Modem Status Register.</description>
          <addressOffset>0x00000014</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xffffffff</resetMask>
          <fields>
            <field>
              <name>DCTSF</name>
              <description>Detect CTS State Change Flag 
This bit is set whenever CTS input has change state, and it will generate Modem interrupt to CPU when IER [Modem_IEN].
NOTE: This bit is cleared by writing 1 to itself.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>CTS_St</name>
              <description>CTS Pin Status 
This bit is the pin status of CTS. </description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>Lev_CTS</name>
              <description>CTS Trigger Level
This bit can change the CTS trigger level.
0= low level triggered
1= high level triggered</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
       <register>
          <name>UA_FSR</name>
          <description>UART0 FIFO Status Register.</description>
          <addressOffset>0x00000018</addressOffset>
          <access>read-only</access>
          <resetValue>0x10404000</resetValue>
          <resetMask>0xefbfbfff</resetMask>
          <fields>
            <field>
              <name>Rx_Over_IF</name>
              <description>Rx overflow Error IF (Read Only) 
This bit is set when Rx FIFO overflow.
If the number of bytes of received data is greater than Rx FIFO(UA_RBR) size, 16 bytes of UART0/UART1, this bit will be set.
NOTE: This bit is cleared by writing 1 to itself.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>RS_485_Add_Det</name>
              <description>RS-485 Address Byte Detection Flag
This bit is set to logic 1 and set UA_RS-485_CSR [RS-485_Add_EN] whenever in RS-485 mode the receiver detect any address byte received address byte character (bit9 = '1') bit&quot;, and it is reset whenever the CPU writes 1 to this bit.
Note: This field is used for RS-485 mode.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>PEF</name>
              <description>Parity Error Flag
This bit is set to logic 1 whenever the received character does not have a valid &quot;parity bit&quot;, and is reset whenever the CPU writes 1 to this bit.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>FEF</name>
              <description>Framing Error Flag
This bit is set to logic 1 whenever the received character does not have a valid &quot;stop bit&quot; (that is, the stop bit following the last data bit or parity bit is detected as a logic 0), and is reset whenever the CPU writes 1 to this bit.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>BIF</name>
              <description>Break Interrupt Flag
This bit is set to a logic 1 whenever the received data input(Rx) is held in the &quot;spacing state&quot; (logic 0) for longer than a full word transmission time (that is, the total time of &quot;start bit&quot; + data bits + parity + stop bits) and is reset whenever the CPU writes 1 to this bit.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>Rx_Pointer</name>
              <description>Rx FIFO pointer (Read Only)
This field indicates the Rx FIFO Buffer Pointer. When UART receives one byte from external device, Rx_Pointer increases one. When one byte of Rx FIFO is read by CPU, Rx_Pointer decreases one.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>Rx_Empty</name>
              <description>Receiver FIFO Empty (Read Only)
This bit initiate Rx FIFO empty or not.
When the last byte of Rx FIFO has been read by CPU, hardware sets this bit high. It will be cleared when UART receives any new data.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>Rx_Full</name>
              <description>Receiver FIFO Full (Read Only)
This bit initiates Rx FIFO full or not.
This bit is set when Rx_Pointer is equal to 16(UART0/UART1), otherwise is cleared by hardware.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>Tx_Pointer</name>
              <description>TX FIFO Pointer (Read Only)
This field indicates the Tx FIFO Buffer Pointer. When CPU write one byte into UA_THR, Tx_Pointer increases one. When one byte of Tx FIFO is transferred to Transmitter Shift Register, Tx_Pointer decreases one.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>Tx_Empty</name>
              <description>Transmitter FIFO Empty (Read Only)
This bit indicates Tx FIFO empty or not.
When the last byte of Tx FIFO has been transferred to Transmitter Shift Register, hardware sets this bit high. It will be cleared when writing data into THR (Tx FIFO not empty).</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>Tx_Full</name>
              <description>Transmitter FIFO Full (Read Only)
This bit indicates Tx FIFO full or not.
This bit is set when Tx_Pointer is equal to 64/16(UART0/UART1), otherwise is cleared by hardware.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>Tx_Over_IF</name>
              <description>Tx Overflow Error Interrupt Flag (Read Only)
If Tx FIFO(UA_THR) is full, an additional write to UA_THR will cause this bit to logic 1. 
NOTE: This bit is cleared by writing 1 to itself.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>TE_Flag</name>
              <description>Transmitter Empty Flag (Read Only)
Bit is set by hardware when Tx FIFO(UA_THR) is empty and the STOP bit of the last byte has been transmitted.
Bit is cleared automatically when Tx FIFO is not empty or the last byte transmission has not completed.
NOTE: This bit is read only. </description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
       <register>
          <name>UA_ISR</name>
          <description>UART0 Interrupt Status Register.</description>
          <addressOffset>0x0000001c</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000042</resetValue>
          <resetMask>0xffffffbd</resetMask>
          <fields>
            <field>
              <name>RDA_IF</name>
              <description>Receive Data Available Interrupt Flag (Read Only).
When the number of bytes in the Rx FIFO equals the RFITL then the RDA_IF will be set. If IER[RDA_IEN] is enabled, the RDA interrupt will be generated. 
NOTE: This bit is read only and it will be cleared when the number of unread bytes of Rx FIFO drops below the threshold level (RFITL).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>THRE_IF</name>
              <description>Transmit Holding Register Empty Interrupt Flag (Read Only). 
This bit is set when the last data of Tx FIFO is transferred to Transmitter Shift Register. If IER[THRE_IEN] is enabled, the THRE interrupt will be generated.
NOTE: This bit is read only and it will be cleared when writing data into THR (Tx FIFO not empty).</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>RLS_IF</name>
              <description>Receive Line Interrupt Flag (Read Only).
In UART mode this bit is set when the Rx receive data have parity error, framing error or break error (at least one of 3 bits, BIF, FEF and PEF, is set). In RS-485 mode, the field includes RS-485 Address Byte Detection Flag. If IER[RLS_IEN] is enabled, the RLS interrupt will be generated.
NOTE: This bit is read only and reset to 0 when all bits of BIF, FEF, PEF and RS-485_Add_Det are cleared.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>Modem_IF</name>
              <description>MODEM Interrupt Flag (Read Only) 
This bit is set when the CTS pin has state change (DCTSF=1). If IER[Modem_IEN] is enabled, the Modem interrupt will be generated.
NOTE: This bit is read only and reset to 0 when bit DCTSF is cleared by a write 1 on DCTSF.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>Tout_IF</name>
              <description>Time Out Interrupt Flag (Read Only)
This bit is set when the Rx FIFO is not empty and no activities occur in the Rx FIFO and the time out counter equal to TOIC. If IER [Tout_IEN] is enabled, the Tout interrupt will be generated. 
NOTE: This bit is read only and user can read UA_RBR (Rx is in active) to clear it.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>Buf_Err_IF</name>
              <description>Buffer Error Interrupt Flag (Read Only)
This bit is set when the Tx or Rx FIFO overflows (Tx_Over_IF or Rx_Over_IF is set). When Buf_Err_IF is set, the transfer maybe not correct. If IER[Buf_Err_IEN] is enabled, the buffer error interrupt will be generated.
NOTE: This bit is cleared when both Tx_Over_IF and Rx_Over_IF are cleared. </description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>RDA_INT</name>
              <description>Receive Data Available Interrupt Indicator to Interrupt Controller (INT_RDA).
An AND output with inputs of RDA_IEN and RDA_IF</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>THRE_INT</name>
              <description>Transmit Holding Register Empty Interrupt Indicator to Interrupt Controller (INT_THRE).
An AND output with inputs of THRE_IEN and THRE_IF</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>RLS_INT</name>
              <description>Receive Line Status Interrupt Indicator to Interrupt Controller (INT_RLS). 
An AND output with inputs of RLS_IEN and RLS_IF
Note: In RS-485 mode, the field includes RS-485 Address Byte Detection Flag.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>Modem_INT</name>
              <description>MODEM Status Interrupt Indicator to Interrupt Controller (INT_MOS). 
An AND output with inputs of Modem_IEN and Modem_IF</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>Tout_INT</name>
              <description>Time Out Interrupt Indicator to Interrupt Controller (INT_Tout)
An AND output with inputs of RTO_IEN and Tout_IF</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
            <field>
              <name>Buf_Err_INT</name>
              <description>Buffer Error Interrupt Indicator to Interrupt Controller (INT_Buf_err)
An AND output with inputs of BUF_ERR_IEN and Buf_Err_IF</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <!-- there is no side effect on writes, therefore <modifiedWriteValues> is not set -->
              <!-- there is no side effect on reads, therefore <readAction> is not set -->
              <!-- oneBitEnable named enumeration that can be reused in other parts of the description -->
            </field>
          </fields>
       </register>
